## 데이터 분석을 위한 SQL 레시피

Data soruce : https://hanbit.co.kr/support/supplement_survey.html?pcode=B8585882565

System : PostgreSQL

In [6]:
import pandas as pd
import psycopg2 as pg2
from sqlalchemy import create_engine

engine = create_engine('postgresql://testuser:testpass@localhost:5432/postgresql_analysis')

con = pg2.connect(host='localhost',
                  user='testuser',
                  password='testpass',
                  database='postgresql_analysis')
con.autocommit = True
cur = con.cursor()

In [7]:
def select(query):
    return pd.read_sql(query, con)

In [8]:
pd.options.display.max_rows = 10

## 14. 사이트 전체의 특징/경향 찾기

### [14-1] 날짜별 접근 데이터를 집계하는 쿼리

In [9]:
select('SELECT * FROM access_log;')

,stamp,short_session,long_session,url,referrer
0,2016-10-01 12:00:00,0CVKaz,1CwlSX,http://www.example.com/?utm_source=google&utm_...,http://www.google.co.jp/xxx
1,2016-10-01 13:00:00,0CVKaz,1CwlSX,http://www.example.com/detail?id=1,
2,2016-10-01 13:00:00,1QceiB,3JMO2k,http://www.example.com/list/cd,
3,2016-10-01 14:00:00,1QceiB,3JMO2k,http://www.example.com/detail?id=1,http://search.google.co.jp/xxx
4,2016-10-01 15:00:00,1hI43A,6SN6DD,http://www.example.com/list/newly,
...,...,...,...,...,...
14,2016-10-02 18:00:00,690mvB,FGkTe9,http://www.example.com/list/dvd?utm_source=yah...,http://www.yahoo.co.jp/xxx
15,2016-10-03 12:00:00,6oABhM,3JMO2k,http://www.example.com/detail?id=3,http://search.yahoo.co.jp/xxx
16,2016-10-03 13:00:00,7jjxQX,KKTw9P,http://www.example.com/?utm_source=mynavi&utm_...,http://www.mynavi.jp/xxx
17,2016-10-03 14:00:00,AAuoEU,6SN6DD,http://www.example.com/list/dvd,https://www.facebook.com/xxx
18,2016-10-03 15:00:00,AAuoEU,6SN6DD,http://www.example.com/list/newly,

In [10]:
select('SELECT * FROM purchase_log;')

                 stamp short_session long_session  purchase_id  amount
0  2016-10-01 15:00:00        0CVKaz       1CwlSX            1    1000
1  2016-10-01 16:00:00        2is8PX       7Dn99b            2    1000
2  2016-10-01 20:00:00        2is8PX       7Dn99b            3    1000
3  2016-10-02 14:00:00        2is8PX       7Dn99b            4    1000

#### 지표 정의

- 방문자 수 : 브라우저를 꺼도 사라지지 않는 쿠키의 유니크 수
- 방문 횟수 : 브라우저를 껐을 때 사라지는 쿠키의 유니크 수
- 페이지 뷰 : 페이지를 출력한 로그의 줄 수

In [11]:
query_141 = """
        SELECT
           substring(stamp, 1, 10) AS dt
           -- 쿠키 계산하기
         , COUNT(DISTINCT long_session) AS access_users
           -- 방문 횟수 계산하기
         , COUNT(DISTINCT short_session) AS access_count
           -- 페이지 뷰 계산하기
         , COUNT(*) AS page_view
           -- 1인당 페이지 뷰 수
         , 1.0 * COUNT(*) / NULLIF(COUNT(DISTINCT long_session), 0) AS pv_per_user
        FROM
           access_log
        GROUP BY
           dt
        ORDER BY
           dt
        ;
        """

select(query_141)

           dt  access_users  access_count  page_view  pv_per_user
0  2016-10-01             4             5          8     2.000000
1  2016-10-02             4             5          7     1.750000
2  2016-10-03             3             3          4     1.333333

### [14-2] URL별로 집계하는 쿼리

In [12]:
query_142 = """
        SELECT
           url
         , COUNT(DISTINCT short_session) AS access_count         
         , COUNT(DISTINCT long_session) AS access_users
         , COUNT(*) AS page_view
        FROM
           access_log
        GROUP BY
           url
        ;
        """

select(query_142)

,url,access_count,access_users,page_view
0,http://www.example.com/,3,3,3
1,http://www.example.com/?utm_source=google&utm_...,1,1,1
2,http://www.example.com/?utm_source=mynavi&utm_...,1,1,1
3,http://www.example.com/detail?id=1,2,2,2
4,http://www.example.com/detail?id=2,2,2,2
5,http://www.example.com/detail?id=3,1,1,1
6,http://www.example.com/list/cd,3,3,3
7,http://www.example.com/list/dvd,2,2,2
8,http://www.example.com/list/dvd?utm_source=yah...,1,1,1
9,http://www.example.com/list/newly,3,2,3

### [14-3] 경로별로 집계하는 쿼리

In [14]:
query_143 = """
        WITH
        access_log_with_path AS (
           SELECT
              *
            , substring(url from '//[^/]+([^?#]+)') AS url_path
           FROM
              access_log
        )
        SELECT
           url_path
         , COUNT(DISTINCT short_session) AS access_count         
         , COUNT(DISTINCT long_session) AS access_users
         , COUNT(*) AS page_view
        FROM
           access_log_with_path
        GROUP BY
           url_path
        ;
        """

select(query_143)

      url_path  access_count  access_users  page_view
0            /             5             4          5
1      /detail             5             3          5
2     /list/cd             3             3          3
3    /list/dvd             3             2          3
4  /list/newly             3             2          3

### [14-4] URL에 의미를 부여해서 집계하는 쿼리

In [16]:
query_144 = """
        WITH
        access_log_with_path AS (
          SELECT
             *
           , substring(url from '//[^/]+([^?#]+)') AS url_path
          FROM
             access_log
        )
        , access_log_with_split_path AS (
          SELECT
             *
             -- split_part로 n번쨰 요소 추출하기
           , split_part(url_path, '/', 2) AS path1
           , split_part(url_path, '/', 3) AS path2
          FROM
             access_log_with_path
        )
        , access_log_with_page_name AS (
          SELECT
             -- 결로를 슬래시로 분할하고, 조건에 따라 페이지 이름 붙이기
             *
           , CASE
              WHEN path1 = 'list' THEN
               CASE
                WHEN path2 = 'newly' THEN 'newly_list'
                ELSE 'category_list'
               END
              -- 이외에 경우는 경로를 그대로 사용하기
              ELSE url_path
             END AS page_name
          FROM
             access_log_with_split_path
        )
        SELECT
           page_name
         , COUNT(DISTINCT short_session) AS access_count         
         , COUNT(DISTINCT long_session) AS access_users
         , COUNT(*) AS page_view
        FROM
           access_log_with_page_name
        GROUP BY
           page_name
        ORDER BY
           page_name        
        ;
        """

select(query_144)

       page_name  access_count  access_users  page_view
0              /             5             4          5
1        /detail             5             3          5
2  category_list             6             4          6
3     newly_list             3             2          3

### [14-5] 유입원별로 방문 횟수 집계하는 쿼리

레퍼러(referer) : 직전 페이지의 URL

유입 경로
- 검색 연동 광고
- 제휴 마케팅 사이트
- AD 네트워크
- 검색 엔진
- 소셜 미디어
- 기타 사이트

In [19]:
query_145 = """
        WITH
        access_log_with_parse_info AS (
          -- 유입원 정보 추출하기
          SELECT
             *
           , substring(url from 'https?://([^/]*)') AS url_domain
           , substring(url from 'utm_source=([^&]*)') AS url_utm_source
           , substring(url from 'utm_medium=([^&]*)') AS url_utm_medium
           , substring(referrer from 'https?://([^/]*)') AS referrer_domain
          FROM
             access_log
        )
        , access_log_with_via_info AS (
          SELECT
             *
           , ROW_NUMBER() OVER(ORDER BY stamp) AS log_id
           , CASE
              --  <> : !=
              WHEN url_utm_source <> '' AND url_utm_medium <> ''
               THEN concat(url_utm_source, '-', url_utm_medium)
              WHEN referrer_domain IN ('search.yahoo.co.jp', 'www.google.co.jp') THEN 'search'
              WHEN referrer_domain IN ('twitter.com', 'www.facebook.com') THEN 'social'
              ELSE 'other'
             END AS via
          FROM
             access_log_with_parse_info
        )
        SELECT
           via
         , COUNT(*) AS access_count         
        FROM
           access_log_with_via_info
        GROUP BY
           via
        ORDER BY
           access_count DESC        
        ;
        """

select(query_145)

                via  access_count
0             other            11
1            social             3
2            search             2
3  mynavi-affiliate             1
4      yahoo-search             1
5     google-search             1

### [14-6] 각 방문에서 구매한 비율(CVR)을 집계하는 쿼리

CVR : 각 방문에서 구매한 비율

In [20]:
query_146 = """
        WITH
        access_log_with_parse_info AS (
          -- 유입원 정보 추출하기
          SELECT
             *
           , substring(url from 'https?://([^/]*)') AS url_domain
           , substring(url from 'utm_source=([^&]*)') AS url_utm_source
           , substring(url from 'utm_medium=([^&]*)') AS url_utm_medium
           , substring(referrer from 'https?://([^/]*)') AS referrer_domain
          FROM
             access_log
        )
        , access_log_with_via_info AS (
          SELECT
             *
           , ROW_NUMBER() OVER(ORDER BY stamp) AS log_id
           , CASE
              --  <> : !=
              WHEN url_utm_source <> '' AND url_utm_medium <> ''
               THEN concat(url_utm_source, '-', url_utm_medium)
              WHEN referrer_domain IN ('search.yahoo.co.jp', 'www.google.co.jp') THEN 'search'
              WHEN referrer_domain IN ('twitter.com', 'www.facebook.com') THEN 'social'
              ELSE 'other'
             END AS via
          FROM
             access_log_with_parse_info
        )
        , access_log_with_purchase_amount AS (
          SELECT
             a.log_id
           , a.via
           , SUM(
              CASE
               WHEN p.stamp::date BETWEEN a.stamp::date AND a.stamp::date + '1 day'::interval
                THEN amount
              END
             ) AS amount
          FROM
             access_log_with_via_info AS a
          LEFT OUTER JOIN
             purchase_log AS p
           ON a.long_session = p.long_session
          GROUP BY
             a.log_id, a.via
        )
        SELECT
           via
         , COUNT(*) AS via_count
           -- 실제 구매를 한 세션의 수
         , COUNT(amount) AS conversions
         , AVG(100.0 * SIGN(COALESCE(amount, 0))) AS cvr
         , SUM(COALESCE(amount, 0)) AS amount
         , AVG(1.0 * COALESCE(amount, 0)) AS avg_amount
        FROM
           access_log_with_purchase_amount
        GROUP BY
           via
        ORDER BY
           cvr DESC        
        ;
        """

select(query_146)

                via  via_count  conversions         cvr  amount   avg_amount
0     google-search          1            1  100.000000  1000.0  1000.000000
1            social          3            1   33.333333  3000.0  1000.000000
2             other         11            2   18.181818  2000.0   181.818182
3            search          2            0    0.000000     0.0     0.000000
4  mynavi-affiliate          1            0    0.000000     0.0     0.000000
5      yahoo-search          1            0    0.000000     0.0     0.000000